---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundError
source: html/2bfa4d09-a91e-7e7b-599f-d005284ee69b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundError Property

No auto-route solution was found.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoAutoRouteSolutionFoundError { get; }
```